Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_cnano/pic32cm_ls00_map_examples/begin/systick_periodic_timeout/firmware/systick_periodic_timeout_secure/src/packs/PIC32CM5164LS00048_DFP/component/fuses.h
#define FUSES_BOCOR_WORD_21_BOOTROM_BOOTKEY_1_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_21) Secure Boot Key bits 63:32 Position */
#define FUSES_BOCOR_WORD_21_BOOTROM_BOOTKEY_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_21_BOOTROM_BOOTKEY_1_Pos) /* (FUSES_BOCOR_WORD_21) Secure Boot Key bits 63:32 Mask */
#define FUSES_BOCOR_WORD_21_BOOTROM_BOOTKEY_1(value) (FUSES_BOCOR_WORD_21_BOOTROM_BOOTKEY_1_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_21_BOOTROM_BOOTKEY_1_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_1 in the FUSES_BOCOR_WORD_21 register */
#define FUSES_BOCOR_WORD_21_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_21) Register Mask  */


/* -------- FUSES_BOCOR_WORD_22 : (FUSES Offset: 0x58) (R/W 32) BOCOR Page Word 22 -------- */
#define FUSES_BOCOR_WORD_22_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_22) BOCOR Page Word 22  Reset Value */

#define FUSES_BOCOR_WORD_22_BOOTROM_BOOTKEY_2_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_22) Secure Boot Key bits 95:64 Position */
#define FUSES_BOCOR_WORD_22_BOOTROM_BOOTKEY_2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_22_BOOTROM_BOOTKEY_2_Pos) /* (FUSES_BOCOR_WORD_22) Secure Boot Key bits 95:64 Mask */
#define FUSES_BOCOR_WORD_22_BOOTROM_BOOTKEY_2(value) (FUSES_BOCOR_WORD_22_BOOTROM_BOOTKEY_2_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_22_BOOTROM_BOOTKEY_2_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_2 in the FUSES_BOCOR_WORD_22 register */
#define FUSES_BOCOR_WORD_22_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_22) Register Mask  */


/* -------- FUSES_BOCOR_WORD_23 : (FUSES Offset: 0x5C) (R/W 32) BOCOR Page Word 23 -------- */
#define FUSES_BOCOR_WORD_23_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_23) BOCOR Page Word 23  Reset Value */

#define FUSES_BOCOR_WORD_23_BOOTROM_BOOTKEY_3_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_23) Secure Boot Key bits 127:96 Position */
#define FUSES_BOCOR_WORD_23_BOOTROM_BOOTKEY_3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_23_BOOTROM_BOOTKEY_3_Pos) /* (FUSES_BOCOR_WORD_23) Secure Boot Key bits 127:96 Mask */
#define FUSES_BOCOR_WORD_23_BOOTROM_BOOTKEY_3(value) (FUSES_BOCOR_WORD_23_BOOTROM_BOOTKEY_3_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_23_BOOTROM_BOOTKEY_3_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_3 in the FUSES_BOCOR_WORD_23 register */
#define FUSES_BOCOR_WORD_23_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_23) Register Mask  */


/* -------- FUSES_BOCOR_WORD_24 : (FUSES Offset: 0x60) (R/W 32) BOCOR Page Word 24 -------- */
#define FUSES_BOCOR_WORD_24_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_24) BOCOR Page Word 24  Reset Value */

#define FUSES_BOCOR_WORD_24_BOOTROM_BOOTKEY_4_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_24) Secure Boot Key bits 159:128 Position */
#define FUSES_BOCOR_WORD_24_BOOTROM_BOOTKEY_4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_24_BOOTROM_BOOTKEY_4_Pos) /* (FUSES_BOCOR_WORD_24) Secure Boot Key bits 159:128 Mask */
#define FUSES_BOCOR_WORD_24_BOOTROM_BOOTKEY_4(value) (FUSES_BOCOR_WORD_24_BOOTROM_BOOTKEY_4_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_24_BOOTROM_BOOTKEY_4_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_4 in the FUSES_BOCOR_WORD_24 register */
#define FUSES_BOCOR_WORD_24_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_24) Register Mask  */


/* -------- FUSES_BOCOR_WORD_25 : (FUSES Offset: 0x64) (R/W 32) BOCOR Page Word 25 -------- */
#define FUSES_BOCOR_WORD_25_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_25) BOCOR Page Word 25  Reset Value */

#define FUSES_BOCOR_WORD_25_BOOTROM_BOOTKEY_5_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_25) Secure Boot Key bits 191:160 Position */
#define FUSES_BOCOR_WORD_25_BOOTROM_BOOTKEY_5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_25_BOOTROM_BOOTKEY_5_Pos) /* (FUSES_BOCOR_WORD_25) Secure Boot Key bits 191:160 Mask */
#define FUSES_BOCOR_WORD_25_BOOTROM_BOOTKEY_5(value) (FUSES_BOCOR_WORD_25_BOOTROM_BOOTKEY_5_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_25_BOOTROM_BOOTKEY_5_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_5 in the FUSES_BOCOR_WORD_25 register */
#define FUSES_BOCOR_WORD_25_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_25) Register Mask  */


/* -------- FUSES_BOCOR_WORD_26 : (FUSES Offset: 0x68) (R/W 32) BOCOR Page Word 26 -------- */
#define FUSES_BOCOR_WORD_26_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_26) BOCOR Page Word 26  Reset Value */

#define FUSES_BOCOR_WORD_26_BOOTROM_BOOTKEY_6_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_26) Secure Boot Key bits 223:192 Position */
#define FUSES_BOCOR_WORD_26_BOOTROM_BOOTKEY_6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_26_BOOTROM_BOOTKEY_6_Pos) /* (FUSES_BOCOR_WORD_26) Secure Boot Key bits 223:192 Mask */
#define FUSES_BOCOR_WORD_26_BOOTROM_BOOTKEY_6(value) (FUSES_BOCOR_WORD_26_BOOTROM_BOOTKEY_6_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_26_BOOTROM_BOOTKEY_6_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_6 in the FUSES_BOCOR_WORD_26 register */
#define FUSES_BOCOR_WORD_26_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_26) Register Mask  */


/* -------- FUSES_BOCOR_WORD_27 : (FUSES Offset: 0x6C) (R/W 32) BOCOR Page Word 27 -------- */
#define FUSES_BOCOR_WORD_27_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_27) BOCOR Page Word 27  Reset Value */

#define FUSES_BOCOR_WORD_27_BOOTROM_BOOTKEY_7_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_27) Secure Boot Key bits 255:224 Position */
#define FUSES_BOCOR_WORD_27_BOOTROM_BOOTKEY_7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_27_BOOTROM_BOOTKEY_7_Pos) /* (FUSES_BOCOR_WORD_27) Secure Boot Key bits 255:224 Mask */
#define FUSES_BOCOR_WORD_27_BOOTROM_BOOTKEY_7(value) (FUSES_BOCOR_WORD_27_BOOTROM_BOOTKEY_7_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_27_BOOTROM_BOOTKEY_7_Pos)) /* Assigment of value for BOOTROM_BOOTKEY_7 in the FUSES_BOCOR_WORD_27 register */
#define FUSES_BOCOR_WORD_27_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_27) Register Mask  */


/* -------- FUSES_BOCOR_WORD_28 : (FUSES Offset: 0x70) (R/W 32) BOCOR Page Word 28 -------- */
#define FUSES_BOCOR_WORD_28_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_28) BOCOR Page Word 28  Reset Value */

#define FUSES_BOCOR_WORD_28_BOOTROM_UDS_0_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_28) DICE UDS Key bits 31:0 Position */
#define FUSES_BOCOR_WORD_28_BOOTROM_UDS_0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_28_BOOTROM_UDS_0_Pos) /* (FUSES_BOCOR_WORD_28) DICE UDS Key bits 31:0 Mask */
#define FUSES_BOCOR_WORD_28_BOOTROM_UDS_0(value) (FUSES_BOCOR_WORD_28_BOOTROM_UDS_0_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_28_BOOTROM_UDS_0_Pos)) /* Assigment of value for BOOTROM_UDS_0 in the FUSES_BOCOR_WORD_28 register */
#define FUSES_BOCOR_WORD_28_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_28) Register Mask  */


/* -------- FUSES_BOCOR_WORD_29 : (FUSES Offset: 0x74) (R/W 32) BOCOR Page Word 29 -------- */
#define FUSES_BOCOR_WORD_29_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_29) BOCOR Page Word 29  Reset Value */

#define FUSES_BOCOR_WORD_29_BOOTROM_UDS_1_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_29) DICE UDS Key bits 63:32 Position */
#define FUSES_BOCOR_WORD_29_BOOTROM_UDS_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_29_BOOTROM_UDS_1_Pos) /* (FUSES_BOCOR_WORD_29) DICE UDS Key bits 63:32 Mask */
#define FUSES_BOCOR_WORD_29_BOOTROM_UDS_1(value) (FUSES_BOCOR_WORD_29_BOOTROM_UDS_1_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_29_BOOTROM_UDS_1_Pos)) /* Assigment of value for BOOTROM_UDS_1 in the FUSES_BOCOR_WORD_29 register */
#define FUSES_BOCOR_WORD_29_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_29) Register Mask  */


/* -------- FUSES_BOCOR_WORD_30 : (FUSES Offset: 0x78) (R/W 32) BOCOR Page Word 30 -------- */
#define FUSES_BOCOR_WORD_30_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_30) BOCOR Page Word 30  Reset Value */

#define FUSES_BOCOR_WORD_30_BOOTROM_UDS_2_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_30) DICE UDS Key bits 95:64 Position */
#define FUSES_BOCOR_WORD_30_BOOTROM_UDS_2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_30_BOOTROM_UDS_2_Pos) /* (FUSES_BOCOR_WORD_30) DICE UDS Key bits 95:64 Mask */
#define FUSES_BOCOR_WORD_30_BOOTROM_UDS_2(value) (FUSES_BOCOR_WORD_30_BOOTROM_UDS_2_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_30_BOOTROM_UDS_2_Pos)) /* Assigment of value for BOOTROM_UDS_2 in the FUSES_BOCOR_WORD_30 register */
#define FUSES_BOCOR_WORD_30_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_30) Register Mask  */


