Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_cnano/pic32cm_ls00_map_examples/begin/systick_periodic_timeout/firmware/systick_periodic_timeout_secure/src/packs/PIC32CM5164LS00048_DFP/component/fuses.h
/* -------- FUSES_BOCOR_WORD_31 : (FUSES Offset: 0x7C) (R/W 32) BOCOR Page Word 31 -------- */
#define FUSES_BOCOR_WORD_31_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_31) BOCOR Page Word 31  Reset Value */

#define FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_31) DICE UDS Key bits 127:96 Position */
#define FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Pos) /* (FUSES_BOCOR_WORD_31) DICE UDS Key bits 127:96 Mask */
#define FUSES_BOCOR_WORD_31_BOOTROM_UDS_3(value) (FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Pos)) /* Assigment of value for BOOTROM_UDS_3 in the FUSES_BOCOR_WORD_31 register */
#define FUSES_BOCOR_WORD_31_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_31) Register Mask  */


/* -------- FUSES_BOCOR_WORD_32 : (FUSES Offset: 0x80) (R/W 32) BOCOR Page Word 32 -------- */
#define FUSES_BOCOR_WORD_32_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_32) BOCOR Page Word 32  Reset Value */

#define FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_32) DICE UDS Key bits 159:128 Position */
#define FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Pos) /* (FUSES_BOCOR_WORD_32) DICE UDS Key bits 159:128 Mask */
#define FUSES_BOCOR_WORD_32_BOOTROM_UDS_4(value) (FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Pos)) /* Assigment of value for BOOTROM_UDS_4 in the FUSES_BOCOR_WORD_32 register */
#define FUSES_BOCOR_WORD_32_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_32) Register Mask  */


/* -------- FUSES_BOCOR_WORD_33 : (FUSES Offset: 0x84) (R/W 32) BOCOR Page Word 33 -------- */
#define FUSES_BOCOR_WORD_33_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_33) BOCOR Page Word 33  Reset Value */

#define FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_33) DICE UDS Key bits 191:160 Position */
#define FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Pos) /* (FUSES_BOCOR_WORD_33) DICE UDS Key bits 191:160 Mask */
#define FUSES_BOCOR_WORD_33_BOOTROM_UDS_5(value) (FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Pos)) /* Assigment of value for BOOTROM_UDS_5 in the FUSES_BOCOR_WORD_33 register */
#define FUSES_BOCOR_WORD_33_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_33) Register Mask  */


/* -------- FUSES_BOCOR_WORD_34 : (FUSES Offset: 0x88) (R/W 32) BOCOR Page Word 34 -------- */
#define FUSES_BOCOR_WORD_34_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_34) BOCOR Page Word 34  Reset Value */

#define FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_34) DICE UDS Key bits 223:192 Position */
#define FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Pos) /* (FUSES_BOCOR_WORD_34) DICE UDS Key bits 223:192 Mask */
#define FUSES_BOCOR_WORD_34_BOOTROM_UDS_6(value) (FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Pos)) /* Assigment of value for BOOTROM_UDS_6 in the FUSES_BOCOR_WORD_34 register */
#define FUSES_BOCOR_WORD_34_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_34) Register Mask  */


/* -------- FUSES_BOCOR_WORD_35 : (FUSES Offset: 0x8C) (R/W 32) BOCOR Page Word 35 -------- */
#define FUSES_BOCOR_WORD_35_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_35) BOCOR Page Word 35  Reset Value */

#define FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_35) DICE UDS Key bits 255:224 Position */
#define FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Pos) /* (FUSES_BOCOR_WORD_35) DICE UDS Key bits 255:224 Mask */
#define FUSES_BOCOR_WORD_35_BOOTROM_UDS_7(value) (FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Pos)) /* Assigment of value for BOOTROM_UDS_7 in the FUSES_BOCOR_WORD_35 register */
#define FUSES_BOCOR_WORD_35_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_35) Register Mask  */


/* -------- FUSES_BOCOR_WORD_56 : (FUSES Offset: 0xE0) (R/W 32) BOCOR Page Word 56 -------- */
#define FUSES_BOCOR_WORD_56_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_56) BOCOR Page Word 56  Reset Value */

#define FUSES_BOCOR_WORD_56_BOOTROM_BOCORHASH_0_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_56) Boot Configuration Row Hash bits 31:0 Position */
#define FUSES_BOCOR_WORD_56_BOOTROM_BOCORHASH_0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_56_BOOTROM_BOCORHASH_0_Pos) /* (FUSES_BOCOR_WORD_56) Boot Configuration Row Hash bits 31:0 Mask */
#define FUSES_BOCOR_WORD_56_BOOTROM_BOCORHASH_0(value) (FUSES_BOCOR_WORD_56_BOOTROM_BOCORHASH_0_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_56_BOOTROM_BOCORHASH_0_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_0 in the FUSES_BOCOR_WORD_56 register */
#define FUSES_BOCOR_WORD_56_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_56) Register Mask  */


/* -------- FUSES_BOCOR_WORD_57 : (FUSES Offset: 0xE4) (R/W 32) BOCOR Page Word 57 -------- */
#define FUSES_BOCOR_WORD_57_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_57) BOCOR Page Word 57  Reset Value */

#define FUSES_BOCOR_WORD_57_BOOTROM_BOCORHASH_1_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_57) Boot Configuration Row Hash bits 63:32 Position */
#define FUSES_BOCOR_WORD_57_BOOTROM_BOCORHASH_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_57_BOOTROM_BOCORHASH_1_Pos) /* (FUSES_BOCOR_WORD_57) Boot Configuration Row Hash bits 63:32 Mask */
#define FUSES_BOCOR_WORD_57_BOOTROM_BOCORHASH_1(value) (FUSES_BOCOR_WORD_57_BOOTROM_BOCORHASH_1_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_57_BOOTROM_BOCORHASH_1_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_1 in the FUSES_BOCOR_WORD_57 register */
#define FUSES_BOCOR_WORD_57_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_57) Register Mask  */


/* -------- FUSES_BOCOR_WORD_58 : (FUSES Offset: 0xE8) (R/W 32) BOCOR Page Word 58 -------- */
#define FUSES_BOCOR_WORD_58_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_58) BOCOR Page Word 58  Reset Value */

#define FUSES_BOCOR_WORD_58_BOOTROM_BOCORHASH_2_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_58) Boot Configuration Row Hash bits 95:64 Position */
#define FUSES_BOCOR_WORD_58_BOOTROM_BOCORHASH_2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_58_BOOTROM_BOCORHASH_2_Pos) /* (FUSES_BOCOR_WORD_58) Boot Configuration Row Hash bits 95:64 Mask */
#define FUSES_BOCOR_WORD_58_BOOTROM_BOCORHASH_2(value) (FUSES_BOCOR_WORD_58_BOOTROM_BOCORHASH_2_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_58_BOOTROM_BOCORHASH_2_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_2 in the FUSES_BOCOR_WORD_58 register */
#define FUSES_BOCOR_WORD_58_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_58) Register Mask  */


/* -------- FUSES_BOCOR_WORD_59 : (FUSES Offset: 0xEC) (R/W 32) BOCOR Page Word 59 -------- */
#define FUSES_BOCOR_WORD_59_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_59) BOCOR Page Word 59  Reset Value */

#define FUSES_BOCOR_WORD_59_BOOTROM_BOCORHASH_3_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_59) Boot Configuration Row Hash bits 127:96 Position */
#define FUSES_BOCOR_WORD_59_BOOTROM_BOCORHASH_3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_59_BOOTROM_BOCORHASH_3_Pos) /* (FUSES_BOCOR_WORD_59) Boot Configuration Row Hash bits 127:96 Mask */
#define FUSES_BOCOR_WORD_59_BOOTROM_BOCORHASH_3(value) (FUSES_BOCOR_WORD_59_BOOTROM_BOCORHASH_3_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_59_BOOTROM_BOCORHASH_3_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_3 in the FUSES_BOCOR_WORD_59 register */
#define FUSES_BOCOR_WORD_59_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_59) Register Mask  */


/* -------- FUSES_BOCOR_WORD_60 : (FUSES Offset: 0xF0) (R/W 32) BOCOR Page Word 60 -------- */
#define FUSES_BOCOR_WORD_60_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_60) BOCOR Page Word 60  Reset Value */

#define FUSES_BOCOR_WORD_60_BOOTROM_BOCORHASH_4_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_60) Boot Configuration Row Hash bits 159:128 Position */
#define FUSES_BOCOR_WORD_60_BOOTROM_BOCORHASH_4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_60_BOOTROM_BOCORHASH_4_Pos) /* (FUSES_BOCOR_WORD_60) Boot Configuration Row Hash bits 159:128 Mask */
#define FUSES_BOCOR_WORD_60_BOOTROM_BOCORHASH_4(value) (FUSES_BOCOR_WORD_60_BOOTROM_BOCORHASH_4_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_60_BOOTROM_BOCORHASH_4_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_4 in the FUSES_BOCOR_WORD_60 register */
#define FUSES_BOCOR_WORD_60_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_60) Register Mask  */


/* -------- FUSES_BOCOR_WORD_61 : (FUSES Offset: 0xF4) (R/W 32) BOCOR Page Word 61 -------- */
#define FUSES_BOCOR_WORD_61_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_61) BOCOR Page Word 61  Reset Value */

#define FUSES_BOCOR_WORD_61_BOOTROM_BOCORHASH_5_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_61) Boot Configuration Row Hash bits 191:160 Position */
#define FUSES_BOCOR_WORD_61_BOOTROM_BOCORHASH_5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_61_BOOTROM_BOCORHASH_5_Pos) /* (FUSES_BOCOR_WORD_61) Boot Configuration Row Hash bits 191:160 Mask */
#define FUSES_BOCOR_WORD_61_BOOTROM_BOCORHASH_5(value) (FUSES_BOCOR_WORD_61_BOOTROM_BOCORHASH_5_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_61_BOOTROM_BOCORHASH_5_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_5 in the FUSES_BOCOR_WORD_61 register */
#define FUSES_BOCOR_WORD_61_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_61) Register Mask  */


/* -------- FUSES_BOCOR_WORD_62 : (FUSES Offset: 0xF8) (R/W 32) BOCOR Page Word 62 -------- */
#define FUSES_BOCOR_WORD_62_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_62) BOCOR Page Word 62  Reset Value */

#define FUSES_BOCOR_WORD_62_BOOTROM_BOCORHASH_6_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_62) Boot Configuration Row Hash bits 223:192 Position */
#define FUSES_BOCOR_WORD_62_BOOTROM_BOCORHASH_6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_62_BOOTROM_BOCORHASH_6_Pos) /* (FUSES_BOCOR_WORD_62) Boot Configuration Row Hash bits 223:192 Mask */
#define FUSES_BOCOR_WORD_62_BOOTROM_BOCORHASH_6(value) (FUSES_BOCOR_WORD_62_BOOTROM_BOCORHASH_6_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_62_BOOTROM_BOCORHASH_6_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_6 in the FUSES_BOCOR_WORD_62 register */
#define FUSES_BOCOR_WORD_62_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_62) Register Mask  */


/* -------- FUSES_BOCOR_WORD_63 : (FUSES Offset: 0xFC) (R/W 32) BOCOR Page Word 63 -------- */
#define FUSES_BOCOR_WORD_63_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_63) BOCOR Page Word 63  Reset Value */

#define FUSES_BOCOR_WORD_63_BOOTROM_BOCORHASH_7_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_63) Boot Configuration Row Hash bits 255:224 Position */
#define FUSES_BOCOR_WORD_63_BOOTROM_BOCORHASH_7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_63_BOOTROM_BOCORHASH_7_Pos) /* (FUSES_BOCOR_WORD_63) Boot Configuration Row Hash bits 255:224 Mask */
#define FUSES_BOCOR_WORD_63_BOOTROM_BOCORHASH_7(value) (FUSES_BOCOR_WORD_63_BOOTROM_BOCORHASH_7_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_63_BOOTROM_BOCORHASH_7_Pos)) /* Assigment of value for BOOTROM_BOCORHASH_7 in the FUSES_BOCOR_WORD_63 register */
#define FUSES_BOCOR_WORD_63_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_63) Register Mask  */


/* -------- FUSES_OTP1_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) OTP1 Page Word 0 -------- */
#define FUSES_OTP1_WORD_0_BOOTROM_SECEN_Pos   _UINT32_(10)                                         /* (FUSES_OTP1_WORD_0) Security Enable Fuse Position */
#define FUSES_OTP1_WORD_0_BOOTROM_SECEN_Msk   (_UINT32_(0x1) << FUSES_OTP1_WORD_0_BOOTROM_SECEN_Pos) /* (FUSES_OTP1_WORD_0) Security Enable Fuse Mask */
#define FUSES_OTP1_WORD_0_BOOTROM_SECEN(value) (FUSES_OTP1_WORD_0_BOOTROM_SECEN_Msk & (_UINT32_(value) << FUSES_OTP1_WORD_0_BOOTROM_SECEN_Pos)) /* Assigment of value for BOOTROM_SECEN in the FUSES_OTP1_WORD_0 register */
#define FUSES_OTP1_WORD_0_Msk                 _UINT32_(0x00000400)                                 /* (FUSES_OTP1_WORD_0) Register Mask  */


/* -------- FUSES_OTP1_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP1 Page Word 1 -------- */
#define FUSES_OTP1_WORD_1_BOOTROM_NVMCRC_Pos  _UINT32_(0)                                          /* (FUSES_OTP1_WORD_1) CRC for NVM DWORD Position */
#define FUSES_OTP1_WORD_1_BOOTROM_NVMCRC_Msk  (_UINT32_(0xFFFFFFFF) << FUSES_OTP1_WORD_1_BOOTROM_NVMCRC_Pos) /* (FUSES_OTP1_WORD_1) CRC for NVM DWORD Mask */
#define FUSES_OTP1_WORD_1_BOOTROM_NVMCRC(value) (FUSES_OTP1_WORD_1_BOOTROM_NVMCRC_Msk & (_UINT32_(value) << FUSES_OTP1_WORD_1_BOOTROM_NVMCRC_Pos)) /* Assigment of value for BOOTROM_NVMCRC in the FUSES_OTP1_WORD_1 register */
#define FUSES_OTP1_WORD_1_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (FUSES_OTP1_WORD_1) Register Mask  */


/* -------- FUSES_OTP2_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP2 Page Word 1 -------- */
#define FUSES_OTP2_WORD_1_PM_NVM3VSWDIS_Pos   _UINT32_(15)                                         /* (FUSES_OTP2_WORD_1) 3V NVM switch disable Position */
#define FUSES_OTP2_WORD_1_PM_NVM3VSWDIS_Msk   (_UINT32_(0x1) << FUSES_OTP2_WORD_1_PM_NVM3VSWDIS_Pos) /* (FUSES_OTP2_WORD_1) 3V NVM switch disable Mask */
#define FUSES_OTP2_WORD_1_PM_NVM3VSWDIS(value) (FUSES_OTP2_WORD_1_PM_NVM3VSWDIS_Msk & (_UINT32_(value) << FUSES_OTP2_WORD_1_PM_NVM3VSWDIS_Pos)) /* Assigment of value for PM_NVM3VSWDIS in the FUSES_OTP2_WORD_1 register */
#define FUSES_OTP2_WORD_1_Msk                 _UINT32_(0x00008000)                                 /* (FUSES_OTP2_WORD_1) Register Mask  */


/* -------- FUSES_USER_WORD_0 : (FUSES Offset: 0x00) (R/W 32) USER Page Word 0 -------- */
#define FUSES_USER_WORD_0_RESETVALUE          _UINT32_(0xB08F4377)                                 /*  (FUSES_USER_WORD_0) USER Page Word 0  Reset Value */

#define FUSES_USER_WORD_0_NVMCTRL_SULCK_Pos   _UINT32_(0)                                          /* (FUSES_USER_WORD_0) NVM Secure Region Locks Position */
#define FUSES_USER_WORD_0_NVMCTRL_SULCK_Msk   (_UINT32_(0x7) << FUSES_USER_WORD_0_NVMCTRL_SULCK_Pos) /* (FUSES_USER_WORD_0) NVM Secure Region Locks Mask */
#define FUSES_USER_WORD_0_NVMCTRL_SULCK(value) (FUSES_USER_WORD_0_NVMCTRL_SULCK_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_NVMCTRL_SULCK_Pos)) /* Assigment of value for NVMCTRL_SULCK in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_NVMCTRL_NSULCK_Pos  _UINT32_(3)                                          /* (FUSES_USER_WORD_0) NVM Non-Secure Region Locks Position */
#define FUSES_USER_WORD_0_NVMCTRL_NSULCK_Msk  (_UINT32_(0x7) << FUSES_USER_WORD_0_NVMCTRL_NSULCK_Pos) /* (FUSES_USER_WORD_0) NVM Non-Secure Region Locks Mask */
#define FUSES_USER_WORD_0_NVMCTRL_NSULCK(value) (FUSES_USER_WORD_0_NVMCTRL_NSULCK_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_NVMCTRL_NSULCK_Pos)) /* Assigment of value for NVMCTRL_NSULCK in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_BOD33USERLEVEL_Pos  _UINT32_(7)                                          /* (FUSES_USER_WORD_0) BOD33 User Level Position */
#define FUSES_USER_WORD_0_BOD33USERLEVEL_Msk  (_UINT32_(0x3F) << FUSES_USER_WORD_0_BOD33USERLEVEL_Pos) /* (FUSES_USER_WORD_0) BOD33 User Level Mask */
#define FUSES_USER_WORD_0_BOD33USERLEVEL(value) (FUSES_USER_WORD_0_BOD33USERLEVEL_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_BOD33USERLEVEL_Pos)) /* Assigment of value for BOD33USERLEVEL in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_BOD33_DIS_Pos       _UINT32_(13)                                         /* (FUSES_USER_WORD_0) BOD33 Disable Position */
#define FUSES_USER_WORD_0_BOD33_DIS_Msk       (_UINT32_(0x1) << FUSES_USER_WORD_0_BOD33_DIS_Pos)   /* (FUSES_USER_WORD_0) BOD33 Disable Mask */
#define FUSES_USER_WORD_0_BOD33_DIS(value)    (FUSES_USER_WORD_0_BOD33_DIS_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_BOD33_DIS_Pos)) /* Assigment of value for BOD33_DIS in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_BOD33_ACTION_Pos    _UINT32_(14)                                         /* (FUSES_USER_WORD_0) BOD33 Action Position */
#define FUSES_USER_WORD_0_BOD33_ACTION_Msk    (_UINT32_(0x3) << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /* (FUSES_USER_WORD_0) BOD33 Action Mask */
#define FUSES_USER_WORD_0_BOD33_ACTION(value) (FUSES_USER_WORD_0_BOD33_ACTION_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_BOD33_ACTION_Pos)) /* Assigment of value for BOD33_ACTION in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_RUNSTDBY_Pos    _UINT32_(25)                                         /* (FUSES_USER_WORD_0) WDT Run During Standby Position */
#define FUSES_USER_WORD_0_WDT_RUNSTDBY_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_RUNSTDBY_Pos) /* (FUSES_USER_WORD_0) WDT Run During Standby Mask */
#define FUSES_USER_WORD_0_WDT_RUNSTDBY(value) (FUSES_USER_WORD_0_WDT_RUNSTDBY_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_WDT_RUNSTDBY_Pos)) /* Assigment of value for WDT_RUNSTDBY in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_ENABLE_Pos      _UINT32_(26)                                         /* (FUSES_USER_WORD_0) WDT Enable Position */
#define FUSES_USER_WORD_0_WDT_ENABLE_Msk      (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_ENABLE_Pos)  /* (FUSES_USER_WORD_0) WDT Enable Mask */
#define FUSES_USER_WORD_0_WDT_ENABLE(value)   (FUSES_USER_WORD_0_WDT_ENABLE_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_WDT_ENABLE_Pos)) /* Assigment of value for WDT_ENABLE in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_Pos    _UINT32_(27)                                         /* (FUSES_USER_WORD_0) WDT Always On Position */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_Msk    (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_ALWAYSON_Pos) /* (FUSES_USER_WORD_0) WDT Always On Mask */
#define FUSES_USER_WORD_0_WDT_ALWAYSON(value) (FUSES_USER_WORD_0_WDT_ALWAYSON_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_WDT_ALWAYSON_Pos)) /* Assigment of value for WDT_ALWAYSON in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_PER_Pos         _UINT32_(28)                                         /* (FUSES_USER_WORD_0) WDT Period Position */
#define FUSES_USER_WORD_0_WDT_PER_Msk         (_UINT32_(0xF) << FUSES_USER_WORD_0_WDT_PER_Pos)     /* (FUSES_USER_WORD_0) WDT Period Mask */
#define FUSES_USER_WORD_0_WDT_PER(value)      (FUSES_USER_WORD_0_WDT_PER_Msk & (_UINT32_(value) << FUSES_USER_WORD_0_WDT_PER_Pos)) /* Assigment of value for WDT_PER in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_Msk                 _UINT32_(0xFE00FFBF)                                 /* (FUSES_USER_WORD_0) Register Mask  */


